taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC1800_DFP.2.7.0.pdsc
    <condition id="LPC1800 CMSIS RTOS SCU">
      <description>NXP LPC1800 with CMSIS, RTOS and SCU</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="SCU"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU GPIO">
      <description>NXP LPC1800 with CMSIS, SCU and GPIO</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU GPDMA">
      <description>NXP LPC1800 with CMSIS, SCU and GPDMA</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU GPIO GPDMA">
      <description>NXP LPC1800 with CMSIS, SCU, GPIO and GPDMA</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU GPIO SPI">
      <description>NXP LPC1800 with CMSIS, SCU, GPIO and SPI</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.0.1"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU GPIO SPI Display">
      <description>NXP LPC1800 with CMSIS, SCU, GPIO, SPI and Display</description>
      <require condition="LPC1800 CMSIS SCU GPIO SPI"/>
      <require Cclass="Graphics" Cgroup="Display" Csub="MCBQVGA_LG" Cvariant="RGB IF"/>
    </condition>

    <condition id="LPC1800 CMSIS I2C Driver">
      <description>NXP LPC1800 with CMSIS and I2C Driver</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
    </condition>

    <condition id="LPC1800 CMSIS RTOS and I2C Driver">
      <description>NXP LPC1800 with CMSIS, RTOS and I2C Driver</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU GPIO SAI/I2C Driver">
      <description>NXP LPC1800 with CMSIS, SCU, GPIO and SAI/I2C Driver</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0.0"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
    </condition>
  </conditions>

  <examples>
    <!-- MCB1800 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Blinky">
      <description>Blinky example</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="Blinky ULp" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Blinky_ULp">
      <description>Blinky ULINKpro example</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB1800/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Demo" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Demo">
      <description>Demo example</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="Boards/Keil/MCB1800/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards/Keil/MCB1800/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="CAN" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/CAN/CAN">
      <description>CAN example that sends and receives data messages</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="CAN.uvprojx"/>
      </project>
      <attributes>
        <category>Middleware</category>
        <category>CAN</category>
      </attributes>
    </example>

